# Formulae
brew "chezmoi" # also the bootstrap prerequisite; listed so it stays updated afterward
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "htop"
brew "neovim"
brew "tmux"
brew "gh"
brew "tree"
brew "git-delta"
brew "timg"
brew "imagemagick"
brew "mise"
brew "shellcheck"

# Casks
cask "ghostty"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
cask "rectangle"
cask "betterdisplay"
cask "raycast"
cask "1password-cli"
cask "keepingyouawake"
cask "gcloud-cli"
